Can't create Curtain Panel. A Panel or a Mullion is probably too small.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateCurtainPanelCorruption { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateCurtainPanelCorruption As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateCurtainPanelCorruption {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainGridFamilyFailures Class
  Autodesk.Revit.DB Namespace